[
  {
    "title": "Pi Reborn",
    "file": "piReborn",
    "status": "Done",
    "photos": ["img/piReborn7.jpg", "img/piReborn8.jpg"],
    "text": "Raspberry Pi powered mini computer that used salvaged parts from my old laptop. So, i used to have an old Acer Aspire 310T that i used since i was 12. I loved that computer because i had good memories with it. It actually the laptop that witnesses my first encounter to Computer Science, yeah, the laptop that i used to bot online games with. And I always feel like it have some part of my soul in it. So when it got too slow, rusty, and old, I just couldn't throw it away, even though I already bought a new Laptop. So i want to make the most out of it. I want to recycle it. So then, i got an idea, what if i salvage my laptop parts, and use my Raspbeery Pi to create a standalone Unix Computer that's less than $75? That's awesome, so there you go, i present you, PiReborn."
  },
  {
    "title": "External Hard Drive from Hard Disk",
    "file": "hardDiskReuse",
    "status": "Done",
    "photos": ["img/hardDisk7.jpg"],
    "text": "This is just a simple mini sunday project that I did on my freshman year. I reuse the old hard disk of my laptop and make it an external hard drive."
  },
  {
    "title": "JackPokePot",
    "file": "jackPokePot",
    "status": "Done",
    "photos": ["img/poke4.png", "img/poke8.png", "img/poke10.png"],
    "text": "This is basically a GUI Java Program that adds pokemon element into a Jackpot Machine. It was an extra credit assignment from one of my CS class on my freshman year in College. I did this partially because Pokemon was my favorite game when i was a kid and also i have a previous code that is basically a Jackpot Machine. SO why not combine them? lol"
  },
  {
    "title": "RizkyWelly.com 1.0",
    "file": "rizkyWelly",
    "status": "Continually Being Developed",
    "photos": ["img/rizkyweb.png"],
    "text": "In Summer 2014, besides having a job as a TA in Foothill College, i also took a Javascript class, which was taught by a very awesome professor. She end up opening the whole Web environment path for me. She covered all essentials for front-end web development, and made me understand it under 6 weeks. So I think, in order to practice what I've learned, I'm going to create my own personal website, which I'm going to call it RizkyWelly.com. and here it is, a post on the very website i mentioned. It's still in constant development as i begin to learn more aspect of web development."
  },
  {
    "title": "Task Slave 1.0",
    "file": "taskSlave",
    "status": "Continually Being Developed",
    "photos": ["img/task_slave_2.png","img/task_slave_4.png"],
    "text": "My first Android App. A simple and reliable To-Do list App that I used in my everyday life. It have basic features such as adding, displaying, editing, deleting, storing tasks. the task is simply a title and a description and a check mark whether you have finished that task or not. I am thinking about developing it much further by adding features such as deadline reminder, priority listing, social media integration, etc. I will probably try to put it in the App store, simply because I want to know how's it like to have an app in there, lol. But yeah, i will definitely keep developing this one, and put the updates on this website"
  },
  {
    "title": "Project Blitz",
    "file": "blitz",
    "status": "On Development",
    "photos": [""],
    "text": "An essay sharing website. On development, my team is considering to continue developing this website. I lead this project with my two other good friends of mine as a team. When i took english classes, i found out that creating an essay without a clear example of how the essay is a pain in the ***. So, me and my team, who went to the same College think about, what if we could create an essay sharing website that could benefit students, without promoting plagiarism. We came up with the name \"Blitz\" since we have to finish this quickly, because summer was our only free time back then, yet we didn't have enough time to finish it. "
  },
  {
    "title": "Project Turnt",
    "file": "turnt",
    "status": "On Development",
    "photos": [""],
    "text": "A social media web app, that have something to do with parties! Me and my team is still doing some development on this one. Due to it's potential awesome product, it wouldn't put details about this project, yet. If it's proven to be cool, I would think about moving this webapps into a mobile platform."
  },
  {
    "title": "Drone",
    "file": "drone",
    "status": "To Be Developed",
    "photos": [""],
    "text": "Since I had a basic understanding of circuitery and quite "
  },
  {
    "title": "Games",
    "file": "games",
    "status": "To Be Developed",
    "photos": [""],
    "text": ""
  }
]