[
    {
        "title": "Why I Majored In Computer Science",
        "photos": ["story1Photo1.jpg", "story1Photo2.jpg", "story1Photo3.jpg", "story1Photo4.jpg"],
        "text": "I’m Muhammad Rizky Wellyanto. I was born and raised in Indonesia. Currently pursuing Computer Science and Engineering in United States, California. Why I pursue computer science? Well, it all started when I was 12, I was playing an online game which was quite popular in Indonesia back then. I just got in to Junior High school and quickly realize that I have less time to play online games, and since schools in Indonesia is really rigorous and time consuming. Somehow I got an idea, what if a robot can play my character while I am studying at school or do my homework? (I always love the idea that one day robots will help humans in doing our daily tasks). So, I wander around websites after websites, and found that there was an open source robot program which is among the programmers / hackers known as “bots”. It was a Perl based client side program that behaves like a game client, this is intended so that the program can fool the server which thinks that every request and data sent from the client side is originated from the player. A couple weeks later I figure out how to configure the program and was amazed by how incredible hundred lines of code can actually level up my characters. This was the first automation program I’ve ever configures. I never knew that hacking has been a part of my life. I remembered, how long I configures the bot program to solve problems in the virtual worlds. If I see that my bot is not solving the problem, or doing actions inefficiently, I’ll immediately debug my codes. It made me constantly checking the stream of data on my pc monitor as soon as I get home. The joy of seeing an automated program works seamlessly was unparalleled. Even though I haven’t known the term “Computer Science” back then, I already knew that this is what I want to do once I grew up, creating machines or program that could help people solving their problem. Those days have passed, I realized that botting is actually illegal, and turn my face towards the field of science that I just discovered. I quickly search about programming languages, and learn Java on my own from textbooks, and of course, online videos (it’s 21st century~). I have a dream that one day, I will come to Silicon Valley, and create a program that can solve everyone’s problem, a perfect world. (Which later I found out that perfection is “by far” impossible, yet still a good direction)."
    },
    {
        "title": "",
        "photos": ["story2Photo1.jpg", "story2Photo2.jpg", "story2Photo3.jpg", "story2Photo4.jpg"],
        "text":""
    }
]