{
  "title": "Pi Reborn",
  "link": "",
  "description": "Raspberry pi mini computer from my old salvaged laptop. UNIX computer that cost less than $75.",
  "steps": [
    {
      "title": "Step 1",
      "photo": "img/piReborn1.jpg",
      "text": "Well, In my case, I need to take my old laptop apart. I actually took it apart before i was going to make a laptop out of it."
    },
    {
      "title": "Step 2",
      "photo": "img/piReborn2.jpg",
      "text": "I took the monitor for this particular project. While the other parts can be used on other different projects. One thing to take note of, is to find out the type, version, or even manufacturer of the LED/LCD screen, since it will be important in the next couple of steps."
    },
    {
      "title": "Step 3",
      "photo": "img/piReborn3.jpg",
      "text": "Get a raspberry pi. It's a $25-$35 mini board that works as a fully functional pc. Mine is the model B+. Make sure it's working and have the Raspbian wheezy installed. I wouldn't go deep into the raspberry pi set up here, since there are many websites that have raspberry pi tutorial already."
    },
    {
      "title": "Step 4",
      "photo": "img/piReborn4.jpg",
      "text": "In order to make the LED/LCD monitor works, you need to add a so called 'monitor adapter circuit' (i'm not really sure how it's called) it's pretty complicated, i couldn't talk in depth about it in this tutorial, because it need a certain understanding of electrical engineering. However, i found out later that there're many of these circuit are actually sold in ebay, which you can look it up. Make sure the circuit is compatible with the LED/LCD monitor you have. Also, you need to make sure that the circuit have a port that can connect to the raspberry pi. In my case, my circuit have a HDMI port that can connect the raspberry pi's HDMI port via HDMI to HDMI cable."
    },
    {
      "title": "Step 5",
      "photo": "img/piReborn5.jpg",
      "text": "Once you hook up the circuit, the monitor will function normally as a stand alone pc monitor! awesome we just create a working monitor less than a third of the market price. As a sidenote, the mini pcb board, connected to the monitor adapter is just a small 'control' board that have buttons just for monitor settings purpose"
    },
    {
      "title": "Step 6",
      "photo": "img/piReborn6.jpg",
      "text": "Before wrapping up, make sure all of the cables are correctly connected, as shown in the picture. Plug the power cable of your raspberry pi to check whether everything works properly or not. If there's an error, it's easier to debug it right now. In my picture i just set up my raspberry pi, but the important thing is the monitor is working."
    },
    {
      "title": "Step 7",
      "photo": "img/piReborn7.jpg",
      "text": "Now, since the item is technically done, let's wrap all of those circuits in a cool casing. I was thinking about using a 3D printed case that I have designed, but since i couldn't get any access to a 3D printer, and to buy one is hella expensive (1500 bucks, damn I'm a college student, I'm broke dude). The same goes to 3D printing service which could cost me around 300 bucks at that moment. Hell no, Imma do neanderthal style: Cardboard and Tapes. Yup it's less than 5 bucks combined hahaha."
    },
    {
      "title": "Step 8",
      "photo": "img/piReborn8.jpg",
      "text": "You can see, it looks pretty weird, but hey, it's functional, it's cheap, it's been working for more than a year now (well the screen is more than 7 years old tho...). As you can see the circuits are inside the box looking thing together with the raspberry pi. I'd say it's like iMac for hobos ahaha. Anyway, I hope this is helpful! have fun hacking!"
    }
  ]
}